[
    {
        "id": "ed80af1f-d0bb-43ef-8bb4-9eab63fc41ec",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ed80af1f-d0bb-43ef-8bb4-9eab63fc41ec",
        "created_at": "Tue May 18 16:12:42 UTC 2021",
        "company": "Car Registration, Inc. ",
        "company_url": null,
        "location": "Elk Grove, Ca - REMOTE",
        "title": "Software Architect/Developer",
        "description": "<p>Car Registration, Inc.</p>\n<p>Car Registration, Inc. (CRI) provides comprehensive, online vehicle registration and titling services for consumers who desire or need a DMV alternative.  Currently licensed and bonded under the California DMV’s Business Partner Automation program, CRI successfully processes over 250,000 transactions per year while reducing wait times and allowing the CA DMV to reallocate its resources to other services and administrative tasks.  With CRI, customers can get same-day processing, next-day delivery, and comprehensive telephone and email support.  Through its website, CRI collects fees from vehicle owners, transmits fees to the DMV in real-time, and issues registration cards and stickers to the customer via USPS or express courier.</p>\n<p>Job Description\nCRI is a leader in providing consumers direct access to DMV services through our online technology. We provide customers the ability to skip the line at the DMV by using our online platform to renew, replace, or transfer their vehicle registration and title. You will join a small but profitable start-up with the ability to shape and grow our software. We are looking for a self-motivated software architect/developer who is comfortable working on a cloud-based full-stack built with Go, PHP, and JavaScript for both customer-facing and internal applications. In your role, you will join a small team of software developers to build new software, new features, and maintain existing functionality.</p>\n<p>This is a full-time remote position with a competitive salary and benefits including medical, dental, vision, 401K plan, and more. We are based in Elk Grove, CA. Though you won’t work in the office, we regularly communicate via Slack and Google Meets. Our annual holiday party is fun and inclusive and offers a great opportunity to catch up with the team in person.</p>\n<p>Skills &amp; Requirements\n●\tAbility to design and implement solutions to both frontend and backend problems from a non-technical specification into a finished feature\n●\t3+ years professional coding with Go, PHP, Python, Ruby, or another server-side scripting language\n●\t2+ years professional coding with JavaScript\n●\t3+ years professional experience with SQL database design (PostgreSQL, MySQL, Oracle, or MSSQL)\n●\tExperience integrating RESTful and/or gRPC APIs\n●\tExperience with DevOps practices including infrastructure as code, continuous integration, monitoring, and logging\n●\tComfortable developing in a Mac or Linux environment\n●\tFamiliarity with event-based functional architectures\n●\tFamiliarity with MVC or MVVM architectures\n●\tSecurity-conscious best practices in any software built\n●\tTeam lead experience</p>\n<p>Desirable Qualifications\n●\t1+ year professional coding with the Go language\n●\tExperience with cloud-based distributed systems on providers such as AWS\n●\tExperience with docker or container technologies\n●\tExperience with CDNs\n●\tExperience developing web-based business applications with complex workflows\n●\tDatabase administration experience including setting up and maintaining replication servers\n●\tBachelor’s degree, preferably in Computer Science or related discipline</p>\n<p>If you are interested, please send your resume to <a href=\"mailto:Jobs@carregistration.com\">Jobs@carregistration.com</a>.</p>\n<p>CANDIDATES only, please.</p>\n<p>Equal Opportunity Employer\nCRI is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding, and related medical conditions), and sexual orientation.</p>\n<p>It is an objective of CRI to achieve a drug-free workplace. Any applicant for employment will be expected to behave in accordance with this objective.</p>\n",
        "how_to_apply": "<p>If you are interested, please send your resume to <a href=\"mailto:Jobs@carregistration.com\">Jobs@carregistration.com</a>.  CANDIDATES only, please.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaG1qIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e3201f4f336dce8ebdee4d47073fde54081a827a/CRI%20FLSP%20Logo.png"
    },
    {
        "id": "f4a7c47f-c8ac-49fa-b15b-4ab37bfd2307",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f4a7c47f-c8ac-49fa-b15b-4ab37bfd2307",
        "created_at": "Tue May 18 09:52:30 UTC 2021",
        "company": "Blindside",
        "company_url": "https://www.blindside.pro",
        "location": "Berlin",
        "title": "Flutter Developer",
        "description": "<p>Blindside is a sports tech start up from Berlin-Adlershof. Professional and amateur coaches and clubs boost their practices with our web and mobile app. We are striving to become the global sport platform, on which coaches exchange their experience, get inspired, and enable their athletes to develop in the best way possible.</p>\n<p>We are currently optimizing our mobile app, reinforcing our infrastructure and in the initial stages of a sports training analytics engine. We ship code often with continuous deployment and do most of our work in Python, Flutter/Dart, and React.</p>\n<p>As our focus shifts more heavily toward mobile development, Blindside are looking for an experienced mobile developer with professional working experience using Flutter.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>You will be immersed into a highly autonomous environment.</li>\n<li>You will design new features and build &amp; maintain within our existing codebase in Flutter</li>\n<li>You will constantly be learning new skills. Researching, conducting trial &amp; error experiments as well as maintaining full ownership of your code, from concept to deployment.</li>\n<li>In your first month, you will be familiarized with our team and have already resolved some bugs and small requests. Your code has gone live multiple times in the first month.</li>\n<li>In the following months, your knowledge of our codebase has drastically increased and you are offering your help in fundamental software architecture decisions. You also feel confident enough to suggest improvement to the team's workflow when you see it doesn't work.</li>\n<li>At the end of your first year, you have successfully contributed to a wide range of projects, even spanning across multiple elements of our system, from backend to mobile. You have established yourself as a self starter and clearly spoken member of our team.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Strong technical background (5+ years) in mobile development (Android or iOS), preferably professional experience working in Flutter</li>\n<li>Ideally you have experience in other areas of software development outside of mobile (backend, frontend, infrastructure, etc.)</li>\n<li>You can comfortably propose technical solutions to business problems and clearly communicate them to your colleagues.</li>\n<li>You are transparent, mindful and empathetic towards your teammates.</li>\n<li>You can easily express your ideas in written and spoken English</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The opportunity to establish yourself as a core member of the development team</li>\n<li>An international team with a wide range of backgrounds</li>\n<li>A salary that matches industry standards</li>\n<li>A respectful atmosphere with a focus on professionalism</li>\n<li>A family-friendly work environment</li>\n<li>State of the art equipment to ensure that you can focus on the right things</li>\n<li>Daily paid lunch at our local canteen</li>\n<li>Yearly budget for individual professional development</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://blindside.join.com/jobs/2248922-flutter-developer?pid=357a3b4531918760973f&amp;oid=1b7223ae-85f3-44df-b767-57095fc2735d&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=flutter%2Bdeveloper\">https://blindside.join.com/jobs/2248922-flutter-developer?pid=357a3b4531918760973f&amp;oid=1b7223ae-85f3-44df-b767-57095fc2735d&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=flutter%2Bdeveloper</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzZqIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--23cbad69864ba3e2e6614bda12beda0b08c03c68/blindside.jpg"
    },
    {
        "id": "0e9e936c-b671-4ae7-b07b-6564b0d40094",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e9e936c-b671-4ae7-b07b-6564b0d40094",
        "created_at": "Fri May 14 15:12:50 UTC 2021",
        "company": "Demyst ",
        "company_url": "http://www.demyst.com",
        "location": "Remote i United States",
        "title": "Junior Back End Developer ",
        "description": "<p>Our Solution</p>\n<p>Demyst unlocks innovation with the power of data. Our platform helps enterprises solve strategic use cases, including lending, risk, digital origination, and automation, by harnessing the power and agility of the external data universe. We are known for harnessing rich, relevant, integrated, linked data to deliver real value in production. We operate as a distributed team in the US and Asia and serve over 50 clients globally as a strategic external data partner. Frictionless external data adoption within tech forward enterprises is unlocking market growth and allowing solutions to finally get out of the lab. If you like to actually get things done and deployed, versus never ending exploration, Demyst is your new home.</p>\n<p>The Challenge</p>\n<p>We are looking for a skilled back end developer to join our team and help lead development on some large projects for household banking and finance names. Reporting to the Director of Product Management, your responsibilities will be to develop projects in league with client requirements and be the subject matter expert for the technology. As Junior Developer you will be working directly with an existing team who are based in North America, New Zealand and Australia to deliver and extend the application.</p>\n<p>Responsibilities:</p>\n<p>-Grow the Product — Develop and maintain product codebase covering the needs for multiple big-\nname clients. Create new features and grow the product impact across multiple geographies.</p>\n<p>-Support Client Delivery — Without happy customers, this product will not exist; everyone will support\nclients to guarantee that they are well served with the platform services.</p>\n<p>-Maintain Clean Code — Clean code is key: a successful candidate will motivate the team to maintain\nclean code and apply coding standards (including code reviews)</p>\n<p>-Grow and Learn — We value your personal growth; We equip every employee with the tools to\nbecome the subject expert matter for technical, platform and development queries.</p>\n<p>Requirements:</p>\n<p>-Demonstrable* 2+ years backend development experience in Ruby on Rails\n-Demonstrable* 2+ years experience in Python or Node.js\n-Experience building and consuming HTTP APIs, both client and server side including swagger\ndefinitions\n-Strong exposure to AWS products (EC2 / ECS, Lambda, DynamoDB, SQS, S3)\nFamiliar with CI/CD, and managing deployment pipelines, using TravisCI primarily.\n-Strong Git experience including branching &amp; PR workflows (e.g. git-flow)\nPM Tool experience (JIRA, Github issues, Asana)\nCollaborative attitude, Great communicator &amp; problem solver\nUnderstands distributed teams and communication methods</p>\n<p>*Demonstrable experience</p>\n<p>Applicants will be expected to be able to present and discuss code they have written and/or contributed to during the interview process. We will require applicants to show examples of their participation in the development community. This can range from a body of work that they have produced in the form of Github repositories, personal websites, a fully completed LinkedIn profiles, portfolios, articles written, Stack Overflow participation etc.</p>\n<p>It does not need to be vast (although that would be fantastic) but we do feel that in 2021 most people have some kind of public profile and that it is important for personal development.</p>\n<p>If you don’t have this kind of public persona, please aim to bring some examples of private work you have done and that you can talk us through. We are all geeks here and would love the opportunity to see some of the genius you have created!</p>\n<p>Benefits</p>\n<p>-Work with the largest consumer and business external data market in an emerging industry that is\nfueling AI globally\n-Outsized impact in a small but rapidly growing team offering real autonomy and responsibility for client\noutcomes\n-Stretch yourself to help define and support something entirely new that will impact billions\nWork within a strong, tight-knit team of subject matter experts and overseeing a team of renaissance\ntechnical talent\n-Small enough where you matter, big enough to have the support to deliver what you promise\n-Distributed working team and culture, recognition of outcomes and merit, not presenteeism\n-Generous benefits &amp; competitive compensation</p>\n<p>Demyst is committed to creating a diverse, rewarding career environment and is proud to be an equal opportunity employer. We strongly encourage individuals from all walks of life to apply.</p>\n",
        "how_to_apply": "<p>To apply, please go to:</p>\n<p><a href=\"https://apply.workable.com/demystdata/j/C6E59596B9/\">https://apply.workable.com/demystdata/j/C6E59596B9/</a></p>\n<p>Scroll down to apply!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdk9pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5b1605ecfded6e2ec93c31be8c8a6fa695996a62/DD%20new%20Logo.png"
    },
    {
        "id": "7861cd49-cc3b-4355-9be2-d136d30b0bc1",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7861cd49-cc3b-4355-9be2-d136d30b0bc1",
        "created_at": "Fri May 14 08:14:54 UTC 2021",
        "company": "Bertrandt Technikum GmbH Ehningen",
        "company_url": "http:",
        "location": "Ehningen",
        "title": "DevOps-Engineer (m/w/d) für virtualisierte CO-Simulationsumgebungen in der Automotive-IT",
        "description": "<p>DevOps-Engineer (m/w/d) für virtualisierte CO-Simulationsumgebungen in der Automotive-IT\nArbeitsort: Ehningen</p>\n<p>Was Sie erwartet:\nDas Auto von morgen ist nicht mehr nur ein Fahrzeug, mit dem man schnell fahren kann, vielmehr wird es zum Kundenerlebnis. Es wird maßgeblich durch seine Software sowie die Performance der darunterliegenden IT bestimmt. Die komplexeren Softwarearchitekturen erfordern die Abkehr von klassischen Absicherungsmethoden hin zu skalierbaren, virtuellen Frameworks. Wir bei Bertrandt denken die Zukunft der Softwareabsicherung in der Automobilbranche komplett neu.</p>\n<ul>\n<li>Werden Sie Teil der Entwicklung virtueller und hochautomatisierter CI/CD-Frameworks um die Herausforderungen von morgen lösen zu können.</li>\n<li>In dieser Position können Sie die spannende Vereinigung von Automobil- und IT-Welten nicht nur beobachten, sondern können dabei direkt mitwirken.</li>\n<li>Sie verantworten die Konzeptionierung, Implementierung und die Inbetriebnahme einzelner Bausteine für virtualisierte Testumgebungen, welche bis in die Cloud skalierbar sind.</li>\n<li>Als Experte in Ihrem Fachgebiet geben Sie wertvolle technische Impulse. Gerne bieten wir Ihnen auch die Perspektive die fachliche Leitung eines Projektteams zu übernehmen.</li>\n</ul>\n<p>Was Sie mitbringen:</p>\n<ul>\n<li>Ein abgeschlossenes Studium der (techn.) Informatik, Software/Systems- Engineering, Elektrotechnik o.ä.</li>\n<li>Mehrjährige Berufserfahrung als DevOps-Engineer und sicherer Umgang mit gängigen DevOps-Tools wie Jenkins (CI/CD), Git, Jira sowie mit „Infrastructure as Code“-Implementierung (z.B. Ansible)</li>\n<li>Fundierte Programmierkenntnisse (z.B. in C, C++, C# oder Python)</li>\n<li>Tiefergehende Kenntnisse der Ethernet-Protokolle (TCP/IP, UDP, VLAN/VxLAN) sowie Routing und Switching</li>\n<li>Praktische Erfahrung mit Virtualisierungsumgebungen wie VMware, Virtualbox und QEMU</li>\n<li>Erfahrung in der Entwicklung auf Linux-basierten Systemen sind von Vorteil</li>\n<li>Sie möchten Ihre Ideen einbringen und haben Spaß an der Lösung von komplexen Fragestellungen</li>\n</ul>\n<p>Wenn Sie auf der Suche nach neuen Herausforderungen sind, Lust haben sich und Ihre Fähigkeiten in ein hoch motiviertes Team einzubringen und in einem dynamischen Umfeld an anspruchsvollen Lösungen für die Fahrzeuge von morgen zu arbeiten, dann sollten wir uns kennenlernen.</p>\n<p>Was wir können:</p>\n<ul>\n<li>Verantwortungsvolle Aufgaben</li>\n<li>Patenmodell</li>\n<li>Flexible Arbeitszeiten</li>\n<li>Eigenverantwortliches Arbeiten</li>\n<li>Firmeninterne Kantine</li>\n<li>Konzernweites \"Netzwerken\"</li>\n<li>Rabatte</li>\n<li>Mobiles Arbeiten</li>\n<li>Sabbatical</li>\n<li>Flache Hierarchien</li>\n</ul>\n<p>Kontakt:\nSwetlana Befort\nTel.: +49 7034 656-5579</p>\n",
        "how_to_apply": "<p><a href=\"https://bertrandtgroup.jobbase.io/apply/vy3rxxu987lqjaftqjaftaj3yfl03ri\">https://bertrandtgroup.jobbase.io/apply/vy3rxxu987lqjaftqjaftaj3yfl03ri</a></p>\n",
        "company_logo": null
    },
    {
        "id": "e77ee3ad-0c35-4c10-b825-5848bf0a6b22",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e77ee3ad-0c35-4c10-b825-5848bf0a6b22",
        "created_at": "Fri May 14 08:08:00 UTC 2021",
        "company": "Bertrandt Technikum GmbH Ehningen ",
        "company_url": "http:",
        "location": "Ehningen",
        "title": "Senior Software-Entwickler (m/w/d) Automotive-IT für CO-Simulationsumgebungen",
        "description": "<p>Senior Software-Entwickler (m/w/d) Automotive-IT für CO-Simulationsumgebungen\nArbeitsort: Ehningen</p>\n<p>Was Sie erwartet:\nDas Auto von morgen ist nicht mehr nur ein Fahrzeug, mit dem man schnell fahren kann, vielmehr wird es zum Kundenerlebnis. Es wird maßgeblich durch seine Software sowie die Performance der darunterliegenden IT bestimmt. Die komplexeren Softwarearchitekturen erfordern die Abkehr von klassischen Absicherungsmethoden hin zu skalierbaren, virtuellen Frameworks. Wir bei Bertrandt denken die Zukunft der Softwareabsicherung in der Automobilbranche komplett neu.</p>\n<pre><code>- Werden Sie Teil der Entwicklung virtueller und hochautomatisierter CI/CD-Frameworks um die Herausforderungen von morgen lösen zu können.\n</code></pre>\n<ul>\n<li>In dieser Position können Sie die spannende Vereinigung von Automobil- und IT-Welten nicht nur beobachten, sondern können dabei direkt mitwirken.</li>\n<li>Sie verantworten die Konzeptionierung, Implementierung und die Inbetriebnahme einzelner Bausteine für virtualisierte Testumgebungen, welche bis in die Cloud skalierbar sind.</li>\n<li>Als Experte in Ihrem Fachgebiet geben Sie wertvolle technische Impulse. Gerne bieten wir Ihnen auch die Perspektive die fachliche Leitung eines Projektteams zu übernehmen.</li>\n</ul>\n<p>Was Sie mitbringen:\n- Abgeschlossenes Studium der (techn.) Informatik, Software/Systems- Engineering, der Elektrotechnik oder vergleichbar</p>\n<ul>\n<li>Idealerweise erste Berufserfahrungen</li>\n<li>Gute Programmierkenntnisse (z.B. in C, C++, C# oder Python)</li>\n<li>Gute Kenntnis der gängigen Fahrzeugbussysteme: CAN(FD), FlexRay, Automotive Ethernet</li>\n<li>Sicherer Umgang in Linux ist wünschenswert</li>\n<li>Praktische Erfahrung in Tools aus der agilen Softwareentwicklung (Jira, Git, Jenkins)</li>\n<li>Sie möchten Ihre Ideen einbringen und haben Spaß an der Lösung von komplexen Fragestellungen</li>\n<li>Sie sind ein Teamplayer und möchten gemeinsam etwas bewegen</li>\n<li>Sie haben bereits erste Erfahrungen in einem der folgenden Tools sammeln können: Synopsys Silver oder Vector CANoe sowie PROVEtech:TA</li>\n<li>Erfahrungen im HiL/SiL- Umfeld sind von Vorteil</li>\n</ul>\n<p>Wenn Sie auf der Suche nach neuen Herausforderungen sind, Lust haben sich und Ihre Fähigkeiten in ein hoch motiviertes Team einzubringen und in einem dynamischen Umfeld an anspruchsvollen Lösungen für die Fahrzeuge von morgen zu arbeiten, dann sollten wir uns kennenlernen.</p>\n<p>Was wir können:</p>\n<ul>\n<li>Verantwortungsvolle Aufgaben</li>\n<li>Patenmodell</li>\n<li>Flexible Arbeitszeiten</li>\n<li>Eigenverantwortliches Arbeiten</li>\n<li>Firmeninterne Kantine</li>\n<li>Konzernweites \"Netzwerken\"</li>\n<li>Kostenfreie Getränke</li>\n<li>Trainingsangebote</li>\n<li>Mobiles Arbeiten</li>\n<li>Flache Hierarchien</li>\n</ul>\n<p>Kontakt:\nSwetlana Befort\nTel.: +49 7034 656-5579</p>\n",
        "how_to_apply": "<p><a href=\"https://bertrandtgroup.jobbase.io/apply/s5hbn9b3mcxcts4nrtt0fmw9vwpoygy\">https://bertrandtgroup.jobbase.io/apply/s5hbn9b3mcxcts4nrtt0fmw9vwpoygy</a></p>\n",
        "company_logo": null
    }
]